---
kind: property
id: P:Autodesk.Revit.DB.FabricationConfigurationInfo.Name
source: html/b7088c16-e145-f01a-7e9d-90a6972bf58d.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.Name Property

The name of the fabrication configuration.

## Syntax (C#)
```csharp
public string Name { get; }
```